
lang_collection = {"ru_lang": "Русский",
                   "ukr_lang": "Солов`їна"}

lang_change_option = {"ru": "Выберите язык",
                      "ukr": "Оберіть мову"}

lang_change = {"ru": "Язык изменён",
               "ukr": "Мову змінено"}

keyboards_lang = {
    "ru": {
        "oracul": "Что меня ждёт?",
        "beer": "Посоветуй пиво",
        "news": "Новости",
        "kurs": "Курс валют",
        "reminder": "Напоминания",
        "aphorism": "Афоризм",
        "menu": "Меню",
        "lang_change": "Изменить язык",
        "location_update": "Обновить часовой пояс",
        "make_choice": "Сделайте свой выбор",
        "timezone_updated": "Спасибо. Часовой пояс обновлён.",
        "beer_abv_na": "Без алкоголя",
        "beer_abv_low": "Слабо алкогольное",
        "beer_abv_mid": "Средне алкогольное",
        "beer_abv_high": "Крепкое",
        "beer_ibu_low": "Слабо или без горечи",
        "beer_ibu_mid": "Умеренно горькое",
        "beer_ibu_high": "Горькое",

    },
    "ukr": {
        "oracul": "Що чекає на мене?",
        "beer": "Порадь пиво",
        "news": "Новини",
        "kurs": "Курс валют",
        "reminder": "Нагадування",
        "aphorism": "Афоризм",
        "menu": "Меню",
        "lang_change": "Змінити мову",
        "location_update": "Оновити часовий пояс",
        "make_choice": "Зробіть свій вибір",
        "timezone_updated": "Дякую. Часовий пояс оновлено.",
        "beer_abv_na": "Без алкоголю",
        "beer_abv_low": "Слабо алкогольне",
        "beer_abv_mid": "Середній алкоголь",
        "beer_abv_high": "Міцне",
        "beer_ibu_low": "Не гірке",
        "beer_ibu_mid": "Помірно гірке",
        "beer_ibu_high": "Гірке",
    },
}

currency_lang = {
    "ru": {
        "name": "Обмен валюты",
        "choice": "Выберите валюту",
        "help": "Введите слово 'Обмен или Меняю' и после, через пробел - сумму и название валюты продажи, и валюту покупки. \n"
                "\n"
                "Пример 1: Обмен 45.6 USD на UAH \n"
                "Пример 2: Меняю 50 долларов на евро \n"
    },
    "ukr": {
        "name": "Обмін валют",
        "choice": "Оберіть валюту",
        "help": "Введіть слово 'Обмін або Міняю' і після, через пробіл - суму та назву валюти продажу і валюту покупки. \n"
                "\n"
                "Пример 1: Обмін 45.6 USD на UAH \n"
                "Пример 2: Міняю 50 долларів на евро \n"

    },
}

currency_exchange_lang = {
    "cur_mapping": {"ru": {'USD': ['usd', 'доллар', 'долларов', 'уе', 'зеленых', 'доллары'],
                           'UAH': ['грн', 'uah', 'гривен', 'гривну', 'гривны'],
                           'EUR': ['евро', 'eur'],
                           'RUB': ['рублей', 'рубль', 'rub', 'рубли']},
                    "ukr": {'USD': ['usd', 'доллар', 'долларів', 'уо', 'зелених', 'доллари'],
                            'UAH': ['грн', 'uah', 'гривень', 'гривню', 'гривні'],
                            'EUR': ['євро', 'eur'],
                            'RUB': ['рублів', 'рубль', 'rub', 'рублі']}
                    },
    'index_error': {
        "ru": 'Пссс.. Могу предложить обменять валюту... воспользуйтесь меню и разделом Курс Валют',
        "ukr": 'Пссс.. Можу запропонувати обмін валюти... скористуйтеся меню та розділом Курс Валют '
    },
    "text_error": {
        "ru": 'Боюсь, что вы допустили ошибку, попробуйте еще разок...',
        "ukr": 'Гадаю що ви припустилися помилки, спробуйте ще раз...'
    },
    "rub_error": {
        "ru": 'Прости, я такое делать не буду...',
        "ukr": 'Вибачаюсь, але я не буду такого робити'
    }
}

oracul_commands_lang = {
    "ru": ['что меня ждет?',
           'что ждет меня?',
           'открой будущее',
           'предскажи будущее',
           'укажи путь',
           ],
    "ukr": ['що чекає на мене?',
            'що на мене чекає?',
            'відкрий майбутнє',
            'вкажи шлях',
            ]
}

reminder_commands_lang = {
    "help": {
        "ru": "Введите дату и событие/действие о котором следует напомнить \n"
              "Пример 1: Напомни завтра в 14:00 вынести мусор \n"
              "Пример 2: Напомни 14.10.2021 в 08:50 позвонить в банк \n",
        "ukr": "Введіть дату і подію/дію про яку слід нагадати \n"
               "Приклад 1: Нагадай завтра о 14:00 винести сміття \n"
               "Приклад 2: Нагадати 14.10.2021 о 08:50 подзвонити у банк \n"
    },
    'saved': {
        "ru": "Сохраненные напоминания",
        "ukr": "Збережені нагадування"
    },
    'del_reminders': {
        "ru": "Удаление напоминаний",
        "ukr": "Видалення нагадувань"
    },
    'empty_list': {
        "ru": "Список пуст :(",
        "ukr": "Список порожній :("
    },
    "sure": {
        "ru": "Вы уверены?",
        "ukr": "Ви впевнені?"
    },
    "yes_delete": {
        "ru": "Да, удалить",
        "ukr": "Так, видалити"
    },
    "not_delete": {
        "ru": "Не удалять",
        "ukr": "Не видяляти"
    },
    "deleted": {
        "ru": "Удалено",
        "ukr": "Видалено"
    },
    "decision": {
        "ru": "Правильное решение",
        "ukr": "Правильне рішення"
    },
    "wrong_time_format": {
        "ru": "Формат времени или значение времени введено не коректно.",
        "ukr": "Формат часу або час вказаний не вірно"
    },
    "time_in_past": {
        "ru": "Боюсь что это это время уже настало или прошло...",
        "ukr": "Нажаль, цей час вже настав або пройшов..."
    },
    "will_be_done": {
        "ru": "Будет сделано!",
        "ukr": "Буде виконано!"
    }
}

reminder_check = {
    "ru": "Просили напомнить",
    "ukr": "Просили нагадати"
}

short_talks_lang = {
    "reminder_words": {
        "ru": ['напомни', 'напомнить', 'напомнишь'],
        "ukr": ['нагадай', 'нагадати', 'нагадаєш']
    },
    "exchange": {
        "ru": ("обмен", "меняю"),
        "ukr": ("обмін", "міняю")
    }
}

beer_card_text = {
    "beer_name": {"ru": "Название",
                  "ukr": "Назва"},
    "brewery_name": {"ru": "Пивоварня",
                     "ukr": "Броварня"},
    "beer_type": {"ru": "Стиль",
                  "ukr": "Стиль"},
    "beer_abv": {"ru": "ABV (Алкоголь)",
                 "ukr": "ABV (Алкоголь)"},
    "beer_ibu": {"ru": "IBU (Горечь)",
                 "ukr": "IBU (Гіркота)"},
    "global_rating_score": {"ru": "Рейтинг Untappd",
                            "ukr": "Рейтинг Untappd"},
}

beer_choice_text = {
    "abv_choice": {"ru": "На сколько крепкое?",
                   "ukr": "На скільки міцне?"},
    "ibu_choice": {"ru": "На сколько горькое?",
                   "ukr": "На скільки гірке?"},
}

no_beer = {"ru": "К сожалению я не могу найти пива по этим критериям. Попробуйте снова - /beer",
           "ukr": "Нажаль, я не можу знайти пива за цими крітеріями. Спробуйте ще - /beer"}
